In [2]:
import pandas as pd

df = pd.read_csv('3. StudentsPerformance.csv')

In [3]:
df

,id,gender,race,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,1,female,group B,bachelor's degree,standard,none,72,72,74
1,2,female,group C,some college,standard,completed,69,90,88
2,3,female,group B,master's degree,standard,none,90,95,93
3,4,male,group A,associate's degree,free/reduced,none,47,57,44
4,5,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...,...
995,996,female,group E,master's degree,standard,completed,88,99,95
996,997,male,group C,high school,free/reduced,none,62,55,55
997,998,female,group C,high school,free/reduced,completed,59,71,65
998,999,female,group D,some college,standard,completed,68,78,77
999,1000,female,group D,some college,free/reduced,none,77,86,86

In [26]:
import sqlite3
import pandas as pd

# Load CSV data
df = pd.read_csv('3. StudentsPerformance.csv')

# Connect to SQLite database (or create it)
conn = sqlite3.connect('mytable.db')
cursor = conn.cursor()

# Save DataFrame to SQL table
df.to_sql('students_performance', conn, if_exists='replace', index=False)

# Read the table back from the database
# tables = pd.read_sql("SELECT * FROM students_performance WHERE gender = 'female'", conn)
table2 = pd.read_sql("SELECT id,race,[parental level of education] FROM students_performance",conn)
# Display the DataFrame
print(table2)

# Close the connection

       id     race parental level of education
0       1  group B           bachelor's degree
1       2  group C                some college
2       3  group B             master's degree
3       4  group A          associate's degree
4       5  group C                some college
..    ...      ...                         ...
995   996  group E             master's degree
996   997  group C                 high school
997   998  group C                 high school
998   999  group D                some college
999  1000  group D                some college

[1000 rows x 3 columns]

ProgrammingError: Cannot operate on a closed database.